Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 = "start"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e9ef2ac84efe71ccccd9672575c60d6352b47432b558a23c13da9d30cb8e7326.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e9ef2ac84efe71ccccd9672575c60d6352b47432b558a23c13da9d30cb8e7326.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6222069017305715740" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/53222f8ee608c84de7549e1709f1b8780e1237d60f44caf8c9a02f196239ecd7.zip" -> "builds/e9ef2ac84efe71ccccd9672575c60d6352b47432b558a23c13da9d30cb8e7326.zip"
          ~ "timestamp" = "1750304497787231000" -> "1753771442597240000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - id                = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::438465168484:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T02:31:23Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-lookup-sendJobEmail" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAWMFUPQRSHFJHKEKKT" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "cognito-idp:ListUsers"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail" -> null
      - code_sha256                    = "+r3BcsdWPz1FFDQkuqn/tZ7JDqvFzjxEJotXoLT2wsc=" -> null
      - description                    = "Invokes sendJobEmail to send email to user" -> null
      - filename                       = "builds/06e182ce701efe79e03103c3bcdacdc3a6ebdcefeb10c45631c4860ce7777488.zip" -> null
      - function_name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-lookup-sendJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail/invocations" -> null
      - last_modified                  = "2025-06-19T05:41:56.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::438465168484:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "+r3BcsdWPz1FFDQkuqn/tZ7JDqvFzjxEJotXoLT2wsc=" -> null
      - source_code_size               = 1061 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_vthn2gpgm"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "346939941039000603" -> null
      - triggers = {
          - "filename"  = "builds/06e182ce701efe79e03103c3bcdacdc3a6ebdcefeb10c45631c4860ce7777488.zip"
          - "timestamp" = "1750304497856439200"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ last_modified                  = "2025-06-19T04:04:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1961319673397733416" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
          ~ "timestamp" = "1750304497653606000" -> "1753771442513831000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:91fc437d682c057df69a6c0aa57fa42251e6519abcd6aa82a6319af70fa5cf13438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:91fc437d682c057df69a6c0aa57fa42251e6519abcd6aa82a6319af70fa5cf13" -> (known after apply)
        name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "a92762352956ff5a04e826d235c3e2ece5dd866d" -> "347a1ae5d8c1c6a5a9bfb3e1d0d040607235ce9f"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/pharmcat" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
        name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a92762352956ff5a04e826d235c3e2ece5dd866d" -> "347a1ae5d8c1c6a5a9bfb3e1d0d040607235ce9f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:4c27d528f5bf09e95342cbf27250df4f4c2d5c8762470d605c6455b786bccc00438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:4c27d528f5bf09e95342cbf27250df4f4c2d5c8762470d605c6455b786bccc00" -> (known after apply)
        name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "2cb101214820a5c13e2fe43f9438e6820d533d87" -> "b3f6023d8013c5dc5974bf791ceb4b7ce8d2b2a7"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/preprocessor" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
        name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "2cb101214820a5c13e2fe43f9438e6820d533d87" -> "b3f6023d8013c5dc5974bf791ceb4b7ce8d2b2a7"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::438465168484:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T02:31:29Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAWMFUPQRSISPWFYHAM" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                        },
                      - {
                          - Action   = "s3:ListBucket"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-getResultsURL" -> null
      - code_sha256                    = "JZsNmAKBg/dZY9nXN9In6ZyEbWhJ70uMNz0ukLmVWFQ=" -> null
      - description                    = "Returns the presigned results URL for PGxFlow pharmcat results" -> null
      - filename                       = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip" -> null
      - function_name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
      - last_modified                  = "2025-06-19T04:04:55.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::438465168484:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "JZsNmAKBg/dZY9nXN9In6ZyEbWhJ70uMNz0ukLmVWFQ=" -> null
      - source_code_size               = 762 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"             = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "RESULT_SUFFIX"              = "_pharmcat_results.json"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "5579737667269875883" -> null
      - triggers = {
          - "filename"  = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip"
          - "timestamp" = "1750304498170984000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat-gnomad:pgxflow-backend-pharmcat-gnomad-0"
        name        = "pgxflow-backend-pharmcat-gnomad-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250619023038383000000003"
              - "RESULT_SUFFIX"            = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3797562833654865178" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304498037343000" -> "1753771442379447000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - id                = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::438465168484:role/pgxflow-backend-initPharmcat" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T02:31:26Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-initPharmcat" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-initPharmcat" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAWMFUPQRSAGZWOSVSO" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:ListBucket"
                          - Condition = {
                              - StringLike = {
                                  - "s3:prefix" = "projects/*/project-files/*"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                        },
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-preprocessor",
                              - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-0" -> null
      - name        = "pgxflow-backend-initPharmcat-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-preprocessor",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-logs" -> null
      - name        = "pgxflow-backend-initPharmcat-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat" -> null
      - code_sha256                    = "Ubl+JvYUK3g1Vn9ObmDJQNo9eM0aO6rJizy2ZoOh2fE=" -> null
      - description                    = "Initializes a PGxFlow PharmCat run" -> null
      - filename                       = "builds/d69bde856056aeaab5b0658ac300deb9a8325cf61a009d888b7b1644240af68e.zip" -> null
      - function_name                  = "pgxflow-backend-initPharmcat" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-initPharmcat" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat/invocations" -> null
      - last_modified                  = "2025-06-19T04:06:03.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::438465168484:role/pgxflow-backend-initPharmcat" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Ubl+JvYUK3g1Vn9ObmDJQNo9eM0aO6rJizy2ZoOh2fE=" -> null
      - source_code_size               = 1290 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DRUGS"                                = "simvastatin,rosuvastatin,pravastatin,pitavastatin,lovastatin,fluvastatin,atorvastatin"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "GENES"                                = "SLCO1B1"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                        = jsonencode(
                    [
                      - {
                          - drug = "CPIC Guideline Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "DPWG Guideline Annotation"
                          - gene = "DPWG"
                        },
                      - {
                          - drug = "FDA Label Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "FDA PGx Association"
                          - gene = "CPIC"
                        },
                    ]
                )
              - "PGXFLOW_PHARMCAT_PREPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-preprocessor"
              - "SEND_JOB_EMAIL_ARN"                   = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "4537767296425692701" -> null
      - triggers = {
          - "filename"  = "builds/d69bde856056aeaab5b0658ac300deb9a8325cf61a009d888b7b1644240af68e.zip"
          - "timestamp" = "1750304498232101000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0"
        name        = "pgxflow-backend-pharmcat-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-postprocessor",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ last_modified                  = "2025-06-19T02:37:52.750+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_CLINIC_JOBS_TABLE"              = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"                        = "pgxflow-backend-20250619023038383000000003"
              - "PGXFLOW_PHARMCAT_POSTPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-postprocessor"
              - "SEND_JOB_EMAIL_ARN"                    = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0"
        name        = "pgxflow-backend-postprocessor-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-gnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip" -> "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-06-19T04:05:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:2",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"                 = "gaspi-dataportal-20250619023046541400000001"
              - "DRUGS"                          = "simvastatin,rosuvastatin,pravastatin,pitavastatin,lovastatin,fluvastatin,atorvastatin"
              - "DYNAMO_CLINIC_JOBS_TABLE"       = "sbeacon-dataportal-clinic-jobs"
              - "GENES"                          = "SLCO1B1"
              - "HTS_S3_HOST"                    = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                  = jsonencode(
                    [
                      - {
                          - drug = "CPIC Guideline Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "DPWG Guideline Annotation"
                          - gene = "DPWG"
                        },
                      - {
                          - drug = "FDA Label Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "FDA PGx Association"
                          - gene = "CPIC"
                        },
                    ]
                )
              - "PGXFLOW_BUCKET"                 = "pgxflow-backend-20250619023038383000000003"
              - "PGXFLOW_PHARMCAT_GNOMAD_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-gnomad"
              - "RESULT_SUFFIX"                  = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"             = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_perm
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.